experiments/results/fio-rand/2-exfat-fuse-randwrite-8.txt
/mnt/test_file: (g=0): rw=randwrite, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=psync, iodepth=1
...
fio-3.33
Starting 8 processes

/mnt/test_file: (groupid=0, jobs=1): err= 0: pid=154991: Sat Aug 23 10:13:56 2025
  write: IOPS=28.2k, BW=110MiB/s (116MB/s)(1104MiB/10025msec); 0 zone resets
    clat (nsec): min=1480, max=36423k, avg=34282.27, stdev=979188.93
     lat (nsec): min=1530, max=36423k, avg=34337.33, stdev=979188.74
    clat percentiles (nsec):
     |  1.00th=[    1608],  5.00th=[    1704], 10.00th=[    1768],
     | 20.00th=[    1864], 30.00th=[    1944], 40.00th=[    2008],
     | 50.00th=[    2096], 60.00th=[    2256], 70.00th=[    2576],
     | 80.00th=[    2864], 90.00th=[    3344], 95.00th=[    4016],
     | 99.00th=[    5792], 99.50th=[    6752], 99.90th=[27131904],
     | 99.95th=[29229056], 99.99th=[33161216]
   bw (  KiB/s): min=100800, max=202304, per=12.56%, avg=113075.20, stdev=21539.31, samples=20
   iops        : min=25200, max=50576, avg=28268.80, stdev=5384.83, samples=20
  lat (usec)   : 2=38.16%, 4=56.69%, 10=5.00%, 20=0.03%, 50=0.01%
  lat (usec)   : 100=0.01%, 250=0.01%
  lat (msec)   : 10=0.01%, 20=0.01%, 50=0.11%
  fsync/fdatasync/sync_file_range:
    sync (nsec): min=209, max=105219, avg=575.36, stdev=1146.57
    sync percentiles (nsec):
     |  1.00th=[  221],  5.00th=[  221], 10.00th=[  221], 20.00th=[  231],
     | 30.00th=[  310], 40.00th=[  330], 50.00th=[  342], 60.00th=[  350],
     | 70.00th=[  370], 80.00th=[  462], 90.00th=[  502], 95.00th=[ 2704],
     | 99.00th=[ 5856], 99.50th=[ 7328], 99.90th=[11072], 99.95th=[12608],
     | 99.99th=[17280]
  cpu          : usr=1.87%, sys=8.29%, ctx=308, majf=0, minf=15
  IO depths    : 1=200.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,282689,0,0 short=0,282688,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1
/mnt/test_file: (groupid=0, jobs=1): err= 0: pid=154992: Sat Aug 23 10:13:56 2025
  write: IOPS=28.2k, BW=110MiB/s (115MB/s)(1104MiB/10020msec); 0 zone resets
    clat (nsec): min=1471, max=36558k, avg=34408.60, stdev=987304.71
     lat (nsec): min=1520, max=36558k, avg=34461.96, stdev=987304.57
    clat percentiles (nsec):
     |  1.00th=[    1560],  5.00th=[    1656], 10.00th=[    1720],
     | 20.00th=[    1816], 30.00th=[    1880], 40.00th=[    1960],
     | 50.00th=[    2040], 60.00th=[    2128], 70.00th=[    2256],
     | 80.00th=[    2448], 90.00th=[    3120], 95.00th=[    3728],
     | 99.00th=[    5536], 99.50th=[    6560], 99.90th=[28180480],
     | 99.95th=[29491200], 99.99th=[33161216]
   bw (  KiB/s): min=100800, max=200792, per=12.55%, avg=112999.60, stdev=21188.10, samples=20
   iops        : min=25200, max=50198, avg=28249.90, stdev=5297.02, samples=20
  lat (usec)   : 2=45.04%, 4=51.25%, 10=3.57%, 20=0.03%, 50=0.01%
  lat (usec)   : 100=0.01%, 250=0.01%
  lat (msec)   : 10=0.01%, 20=0.01%, 50=0.11%
  fsync/fdatasync/sync_file_range:
    sync (nsec): min=209, max=101979, avg=471.26, stdev=938.41
    sync percentiles (nsec):
     |  1.00th=[  211],  5.00th=[  221], 10.00th=[  221], 20.00th=[  241],
     | 30.00th=[  251], 40.00th=[  262], 50.00th=[  302], 60.00th=[  342],
     | 70.00th=[  350], 80.00th=[  370], 90.00th=[  422], 95.00th=[  540],
     | 99.00th=[ 5472], 99.50th=[ 6752], 99.90th=[10048], 99.95th=[11456],
     | 99.99th=[15424]
  cpu          : usr=3.35%, sys=6.04%, ctx=305, majf=0, minf=13
  IO depths    : 1=200.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,282500,0,0 short=0,282499,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1
/mnt/test_file: (groupid=0, jobs=1): err= 0: pid=154993: Sat Aug 23 10:13:56 2025
  write: IOPS=28.0k, BW=110MiB/s (115MB/s)(1097MiB/10012msec); 0 zone resets
    clat (nsec): min=1480, max=37313k, avg=34629.13, stdev=989466.64
     lat (nsec): min=1520, max=37313k, avg=34683.07, stdev=989466.51
    clat percentiles (nsec):
     |  1.00th=[    1592],  5.00th=[    1688], 10.00th=[    1736],
     | 20.00th=[    1816], 30.00th=[    1896], 40.00th=[    1960],
     | 50.00th=[    2064], 60.00th=[    2160], 70.00th=[    2384],
     | 80.00th=[    2800], 90.00th=[    3440], 95.00th=[    4192],
     | 99.00th=[    5920], 99.50th=[    6944], 99.90th=[27656192],
     | 99.95th=[29229056], 99.99th=[33161216]
   bw (  KiB/s): min=100800, max=194136, per=12.48%, avg=112306.80, stdev=20063.28, samples=20
   iops        : min=25200, max=48534, avg=28076.70, stdev=5015.82, samples=20
  lat (usec)   : 2=44.44%, 4=49.66%, 10=5.70%, 20=0.09%, 100=0.01%
  lat (usec)   : 250=0.01%
  lat (msec)   : 10=0.01%, 50=0.11%
  fsync/fdatasync/sync_file_range:
    sync (nsec): min=209, max=106998, avg=440.00, stdev=768.64
    sync percentiles (nsec):
     |  1.00th=[  211],  5.00th=[  221], 10.00th=[  221], 20.00th=[  241],
     | 30.00th=[  302], 40.00th=[  342], 50.00th=[  342], 60.00th=[  362],
     | 70.00th=[  370], 80.00th=[  390], 90.00th=[  482], 95.00th=[  510],
     | 99.00th=[ 4048], 99.50th=[ 5152], 99.90th=[ 9536], 99.95th=[11072],
     | 99.99th=[14400]
  cpu          : usr=1.86%, sys=7.73%, ctx=305, majf=0, minf=13
  IO depths    : 1=200.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,280768,0,0 short=0,280767,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1
/mnt/test_file: (groupid=0, jobs=1): err= 0: pid=154994: Sat Aug 23 10:13:56 2025
  write: IOPS=28.1k, BW=110MiB/s (115MB/s)(1100MiB/10001msec); 0 zone resets
    clat (nsec): min=1470, max=36487k, avg=34292.61, stdev=979331.13
     lat (nsec): min=1510, max=36487k, avg=34348.59, stdev=979330.92
    clat percentiles (nsec):
     |  1.00th=[    1576],  5.00th=[    1672], 10.00th=[    1736],
     | 20.00th=[    1816], 30.00th=[    1896], 40.00th=[    1976],
     | 50.00th=[    2096], 60.00th=[    2224], 70.00th=[    2480],
     | 80.00th=[    2832], 90.00th=[    3408], 95.00th=[    4192],
     | 99.00th=[    6176], 99.50th=[    7328], 99.90th=[27394048],
     | 99.95th=[29229056], 99.99th=[33161216]
   bw (  KiB/s): min=100704, max=199768, per=12.53%, avg=112824.84, stdev=21577.09, samples=19
   iops        : min=25176, max=49942, avg=28206.21, stdev=5394.27, samples=19
  lat (usec)   : 2=41.83%, 4=52.41%, 10=5.55%, 20=0.10%, 50=0.01%
  lat (usec)   : 100=0.01%, 250=0.01%
  lat (msec)   : 10=0.01%, 20=0.01%, 50=0.11%
  fsync/fdatasync/sync_file_range:
    sync (nsec): min=209, max=109458, avg=557.30, stdev=1211.23
    sync percentiles (nsec):
     |  1.00th=[  221],  5.00th=[  221], 10.00th=[  221], 20.00th=[  231],
     | 30.00th=[  270], 40.00th=[  330], 50.00th=[  350], 60.00th=[  362],
     | 70.00th=[  370], 80.00th=[  422], 90.00th=[  502], 95.00th=[  684],
     | 99.00th=[ 5792], 99.50th=[ 7072], 99.90th=[10816], 99.95th=[12736],
     | 99.99th=[17280]
  cpu          : usr=1.46%, sys=8.81%, ctx=303, majf=0, minf=14
  IO depths    : 1=200.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,281494,0,0 short=0,281493,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1
/mnt/test_file: (groupid=0, jobs=1): err= 0: pid=154995: Sat Aug 23 10:13:56 2025
  write: IOPS=28.5k, BW=111MiB/s (117MB/s)(1113MiB/10001msec); 0 zone resets
    clat (nsec): min=1460, max=36494k, avg=33901.89, stdev=973638.45
     lat (nsec): min=1510, max=36494k, avg=33963.94, stdev=973638.15
    clat percentiles (nsec):
     |  1.00th=[    1608],  5.00th=[    1704], 10.00th=[    1768],
     | 20.00th=[    1864], 30.00th=[    1928], 40.00th=[    2008],
     | 50.00th=[    2096], 60.00th=[    2256], 70.00th=[    2544],
     | 80.00th=[    2864], 90.00th=[    3408], 95.00th=[    4128],
     | 99.00th=[    6176], 99.50th=[    7264], 99.90th=[27394048],
     | 99.95th=[28966912], 99.99th=[33161216]
   bw (  KiB/s): min=100800, max=228216, per=12.70%, avg=114327.16, stdev=27979.35, samples=19
   iops        : min=25200, max=57054, avg=28581.79, stdev=6994.84, samples=19
  lat (usec)   : 2=38.42%, 4=55.96%, 10=5.46%, 20=0.05%, 50=0.01%
  lat (usec)   : 100=0.01%, 250=0.01%
  lat (msec)   : 20=0.01%, 50=0.10%
  fsync/fdatasync/sync_file_range:
    sync (nsec): min=200, max=102658, avg=565.14, stdev=1128.02
    sync percentiles (nsec):
     |  1.00th=[  211],  5.00th=[  221], 10.00th=[  221], 20.00th=[  241],
     | 30.00th=[  330], 40.00th=[  342], 50.00th=[  350], 60.00th=[  362],
     | 70.00th=[  370], 80.00th=[  450], 90.00th=[  502], 95.00th=[  660],
     | 99.00th=[ 5856], 99.50th=[ 7072], 99.90th=[10304], 99.95th=[11456],
     | 99.99th=[15040]
  cpu          : usr=1.28%, sys=9.02%, ctx=304, majf=0, minf=13
  IO depths    : 1=200.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,285034,0,0 short=0,285034,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1
/mnt/test_file: (groupid=0, jobs=1): err= 0: pid=154996: Sat Aug 23 10:13:56 2025
  write: IOPS=28.1k, BW=110MiB/s (115MB/s)(1098MiB/10004msec); 0 zone resets
    clat (nsec): min=1480, max=37370k, avg=34405.45, stdev=983209.08
     lat (nsec): min=1530, max=37370k, avg=34461.55, stdev=983208.91
    clat percentiles (nsec):
     |  1.00th=[    1608],  5.00th=[    1688], 10.00th=[    1752],
     | 20.00th=[    1832], 30.00th=[    1896], 40.00th=[    1976],
     | 50.00th=[    2064], 60.00th=[    2192], 70.00th=[    2416],
     | 80.00th=[    2800], 90.00th=[    3408], 95.00th=[    4128],
     | 99.00th=[    5792], 99.50th=[    6688], 99.90th=[27394048],
     | 99.95th=[29229056], 99.99th=[33161216]
   bw (  KiB/s): min=100800, max=196184, per=12.51%, avg=112641.26, stdev=21034.19, samples=19
   iops        : min=25200, max=49046, avg=28160.32, stdev=5258.55, samples=19
  lat (usec)   : 2=42.35%, 4=52.18%, 10=5.34%, 20=0.02%, 50=0.01%
  lat (usec)   : 100=0.01%, 250=0.01%
  lat (msec)   : 10=0.01%, 20=0.01%, 50=0.11%
  fsync/fdatasync/sync_file_range:
    sync (nsec): min=200, max=106759, avg=496.35, stdev=932.73
    sync percentiles (nsec):
     |  1.00th=[  211],  5.00th=[  221], 10.00th=[  221], 20.00th=[  241],
     | 30.00th=[  282], 40.00th=[  342], 50.00th=[  342], 60.00th=[  362],
     | 70.00th=[  370], 80.00th=[  402], 90.00th=[  490], 95.00th=[  588],
     | 99.00th=[ 4448], 99.50th=[ 5536], 99.90th=[10304], 99.95th=[11712],
     | 99.99th=[14656]
  cpu          : usr=1.31%, sys=8.75%, ctx=302, majf=0, minf=14
  IO depths    : 1=200.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,281024,0,0 short=0,281023,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1
/mnt/test_file: (groupid=0, jobs=1): err= 0: pid=154997: Sat Aug 23 10:13:56 2025
  write: IOPS=28.2k, BW=110MiB/s (115MB/s)(1101MiB/10012msec); 0 zone resets
    clat (nsec): min=1480, max=37033k, avg=34419.45, stdev=982306.45
     lat (nsec): min=1520, max=37034k, avg=34478.61, stdev=982306.20
    clat percentiles (nsec):
     |  1.00th=[    1608],  5.00th=[    1704], 10.00th=[    1768],
     | 20.00th=[    1864], 30.00th=[    1944], 40.00th=[    2024],
     | 50.00th=[    2096], 60.00th=[    2256], 70.00th=[    2640],
     | 80.00th=[    2928], 90.00th=[    3504], 95.00th=[    4320],
     | 99.00th=[    6112], 99.50th=[    7200], 99.90th=[27656192],
     | 99.95th=[29229056], 99.99th=[33161216]
   bw (  KiB/s): min=100800, max=202840, per=12.53%, avg=112742.00, stdev=21965.25, samples=20
   iops        : min=25200, max=50710, avg=28185.50, stdev=5491.31, samples=20
  lat (usec)   : 2=37.52%, 4=56.28%, 10=6.04%, 20=0.05%, 50=0.01%
  lat (usec)   : 100=0.01%, 250=0.01%
  lat (msec)   : 10=0.01%, 20=0.01%, 50=0.11%
  fsync/fdatasync/sync_file_range:
    sync (nsec): min=209, max=105859, avg=493.23, stdev=861.13
    sync percentiles (nsec):
     |  1.00th=[  221],  5.00th=[  221], 10.00th=[  221], 20.00th=[  282],
     | 30.00th=[  330], 40.00th=[  342], 50.00th=[  350], 60.00th=[  362],
     | 70.00th=[  370], 80.00th=[  462], 90.00th=[  502], 95.00th=[  564],
     | 99.00th=[ 4576], 99.50th=[ 5600], 99.90th=[ 9792], 99.95th=[11072],
     | 99.99th=[14400]
  cpu          : usr=2.68%, sys=7.38%, ctx=304, majf=0, minf=11
  IO depths    : 1=200.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,281856,0,0 short=0,281855,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1
/mnt/test_file: (groupid=0, jobs=1): err= 0: pid=154998: Sat Aug 23 10:13:56 2025
  write: IOPS=28.0k, BW=109MiB/s (115MB/s)(1096MiB/10016msec); 0 zone resets
    clat (nsec): min=1450, max=36517k, avg=34599.96, stdev=987806.03
     lat (nsec): min=1490, max=36517k, avg=34653.02, stdev=987805.91
    clat percentiles (nsec):
     |  1.00th=[    1592],  5.00th=[    1688], 10.00th=[    1752],
     | 20.00th=[    1832], 30.00th=[    1896], 40.00th=[    1976],
     | 50.00th=[    2064], 60.00th=[    2160], 70.00th=[    2320],
     | 80.00th=[    2672], 90.00th=[    3312], 95.00th=[    3888],
     | 99.00th=[    5408], 99.50th=[    6432], 99.90th=[27656192],
     | 99.95th=[29229056], 99.99th=[33161216]
   bw (  KiB/s): min=100800, max=185432, per=12.47%, avg=112231.60, stdev=18058.53, samples=20
   iops        : min=25200, max=46358, avg=28057.90, stdev=4514.63, samples=20
  lat (usec)   : 2=42.84%, 4=52.84%, 10=4.16%, 20=0.05%, 100=0.01%
  lat (usec)   : 250=0.01%
  lat (msec)   : 20=0.01%, 50=0.11%
  fsync/fdatasync/sync_file_range:
    sync (nsec): min=209, max=108419, avg=514.38, stdev=974.53
    sync percentiles (nsec):
     |  1.00th=[  221],  5.00th=[  221], 10.00th=[  221], 20.00th=[  241],
     | 30.00th=[  330], 40.00th=[  342], 50.00th=[  350], 60.00th=[  362],
     | 70.00th=[  370], 80.00th=[  390], 90.00th=[  450], 95.00th=[  588],
     | 99.00th=[ 5216], 99.50th=[ 6752], 99.90th=[10560], 99.95th=[12096],
     | 99.99th=[16064]
  cpu          : usr=2.28%, sys=7.35%, ctx=304, majf=0, minf=12
  IO depths    : 1=200.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,280580,0,0 short=0,280579,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
  WRITE: bw=879MiB/s (922MB/s), 109MiB/s-111MiB/s (115MB/s-117MB/s), io=8812MiB (9240MB), run=10001-10025msec

Disk stats (read/write):
  nvme0n1: ios=2/0, merge=0/0, ticks=0/0, in_queue=0, util=0.04%